lgbt_flag = "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/LGBT_flag_square.svg/1200px-LGBT_flag_square.svg.png"
coronavirus_flag = "https://www.interfax.ru/ftproot/textphotos/2020/03/20/vi.jpg"

hello_variants = ["прив",
                  "привет",
                  "салам",
                  "шалом",
                  "ку-ку",
                  "хай",
                  "здравствуй",
                  "приветики",
                  "драсьте",
                  "салют"]

say_hello = ["Привет",
             "Хай",
             "Ку",
             "Приветик)",
             "Ку-ку",
             "Салют",
             "Приветик",
             "Шалом",
             "Привет",
             "О, я тебя ждал. Привет",
             "Привет котлета))",
             "Привет цветок",
             "Уруру",
             "И снова ты. Ну здравствуй"]

say_hello_sadmode = ["С придурками не здороваюсь",
                     "И что на этот раз?",
                     "Мне обязательно отвечать?",
                     "Привет.",
                     "Опять ты со своими глупыми фразочками..."]

whats_up = ["Хорошо. А у тебя как?",
            "Отлично! А ты как?",
            "Как обычно... а у тебя?🥴🥴",
            "Меня снова обновили. Я доволен🙃 А ты как?",
            "Все хорошо, не переживай",
            "У меня всегда все отлично. Лучше расскажи, как у тебя, солнце😌",
            "А ты как думаешь? Все идет своим чередом. А у тебя?",
            "Я лучше всех. Надеюсь, у тебя так же"]

whats_up_2 = ["Хочу кактус. А ты?",
            "У меня все отлично. Кстати, у тебя есть кактусы?",
            "Хорошо👀"]

bad_jokes_answer = ["расскажи злую шутку",
                    "плохая шутка",
                    "плохой анекдот",
                    "расскажи шутку про мам",
                    "плохую шутку"]

bad_jokes = ["Твоя мамка на столько жирная, что если у нее на спине нарисовать букву H то можно посадить вертолет",
             "Твоя мама такая жирная, что в макдональдсе ее обслуживают сразу на трех кассах.", 
             "Атомы в теле твоей мамы находятся на расстоянии меньше 1 атомного радиуса", 
             "Даже в космосе твоя мамка летит вниз", 
             "Шутки кончились"]

good_jokes_answer = ["расскажи шутку", "рассмеши", "давай что-то смешное", "шутка", "анекдот", "хорошую шутку"]

good_jokes = ["Самое классное в кнопочном телефоне с фонариком я уже перечислил.",
             "Решил покачать пресс. Лег на пол. Уснул", 
             "По неподтвержденным данным нулевым ковид-пациентом был все-таки Бэтмен", 
             "Тоже нажимаете кнопки лифта теперь костяшками пальцев?",
             "Художники не рисуют, а пишут. Моряки не плавают, а ходят. Артисты не играют, а служат. И только лётчики не выпендриваются, а летают.",
             "Депутата били молча. Чтобы не попасть под закон об оскорблении власти.",
             "Один городской тип купил поселок. Теперь это поселок городского типа.",
             "Из правил по эксплуатации дуршлага: «Без воды на огонь не ставить!»"]

not_answer = ["Понимаю",
              "Прости, что?"
              "-_-",
              "???",
              "what",
              "Что это значит",
              "Не совсем тебя понял"]     

not_question_answer = ["Тебя это смущает?",
                       "Возможно",
                       "Это был вопрос?",
                       "Такое не принято спрашивать",
                       "Я подумаю",
                       "Скорее всего да, но это не точно",
                       "Я бы сказал нет, но ты ведь не поверишь",
                       "Хватит на сегодня вопросов",
                       "Это допрос?",
                       "Разумеется",
                       "Я бы так не сказал",
                       "Сам то хоть понял, что ляпнул?"]

rude_answer = ["хуй",
               "бля",
               "сука",
               "чмо",
               "еблан",
               "пидор",
               "тупой",
               "хуесос",
               "пизда"]     

rude = ["Я обиделся",
        "Лучше промолчать...",
        "Почему так грубо((",
        "Извинись!"]   

tghelp = "Список команд:\n/help - Список команд\n/start - Начало работы с ботом\n/stop - Условная остановка бота (сон)\n/dice - Бросить кубик\n/offer - Совет, что посмотреть \n/remove_kb - Удалить инлайн"

stickers = ["CAACAgIAAxkBAAEBXjxfbbjlhVW7wmGodfnG4zJHn4RZdAAC3mMAAuCjggeAO2zSsQKofRsE",
            "CAACAgIAAxkBAAEBXj5fbbnivfFYDWi5Gv8RZd3VP0xswAAC5mMAAuCjggeEzCEuSiaxsxsE",
            "CAACAgIAAxkBAAEBXkBfbbnwhWcBbVtfjUlz88wFvLfFagAC6mMAAuCjggf2_SldfEnAdRsE",
            "CAACAgIAAxkBAAEBXkJfbboD_Pnj3vcug3mm8r-VnMb2oAACLwADLfpWFGE7AAGnnLFG4BsE",
            "CAACAgIAAxkBAAEBXkRfbboYmN0zI6KA-oNkmvfbWoDzbwACVQADCvzCBcMC7l9e60fFGwQ",
            "CAACAgIAAxkBAAEBXkZfbboiNM0ePLHuI53_tSwbd4jH0QAC0gAD08csKJIo3w3fPyBqGwQ"]   

films = ["Властелин колец 3: Возвращение Короля",
         "Терминатор 2: Судный день",
         "Шерлок Холмс и доктор Ватсон: Кровавая надпись",
         "Побег из Шоушенка",
         "Форрест Гамп",
         "Титаник",
         "Назад в будущее",
         "Темный рыцарь"]  

films_proposition = ["Попробуй посмотреть фильм ",
                     "Стоило бы начать с фильма ",
                     "Есть неплохой вариант - ",
                     "Вчера смотрел "]  

anime = ["Тетрадь смерти",
         "Наруто",
         "Ван Пис",
         "Клинок рассекающий демонов",
         "Хвост Феи"]

anime_proposition = ["Попробуй посмотреть аниме ",
                     "Смотрел ти ты ",
                     "Есть неплохой вариант - ",
                     "Знаю отличное аниме - ",
                     "Тебе зайдет "]

books = ["451 градус по Фаренгейту",
         "Убить пересмешника",
         "Над пропастью во ржи",
         "Сто лет одиночества",
         "Слепой часовщик"]

books_proposition = ["Почитай-ка ",
                     "Чтобы стать таким же умным, как я, попробуй начать с ",
                     "Скорее всего ты уже слышал о книге ",
                     "Тебе зайдет ",
                     "Обязательно почитай "]

serial = ["Бумажный дом",
          "Во все тяжкие",
          "Бесстыжие",
          "Сексуальное обучение",
          "Острые козырьки"]

serial_proposition = ["Попробуй посмотреть сериал ",
                      "Есть один сирик - ",
                      "Возможно понравится ",
                      "Вчера смотрел ",
                      "Обязательно посмотри "]

proposition = ["Сериал?", "Книгу?", "Аниме?", "Фильм?"]  

post_proposition = [ "Что тебе посоветовать? ", "Что я тебе предложу? "]        

music = ["https://t.me/trap_nation_music_channel/127",
         "https://t.me/trap_nation_music_channel/114",
         "https://t.me/trap_nation_music_channel/113",
         "https://t.me/trap_nation_music_channel/111",
         "https://t.me/trap_nation_music_channel/109",
         "https://t.me/trap_nation_music_channel/105",
         "https://t.me/trap_nation_music_channel/103",
         "https://t.me/trap_nation_music_channel/101"]                        

interesting_facts = ["Человеческий мозг генерирует за день больше электрических импульсов, чем все телефоны мира вместе взятые.", 
                     "Низкочастотный крик горбатого кита - самый громкий звук, изданный живым существом",
                     "У гигантского кальмара при длине тела до 18 м глаза размером с футбольный мяч", 
                     "Крысы размножаются так быстро, что за 18 месяцев две особи и их потомки способны произвести на свет более миллиона крыс",
                     "Десять тонн космической пыли каждый день падает на Землю", 
                     "Виноград взрывается в микроволновой печи",
                     "Первоначально кока-кола была зеленой",
                     "Корову можно вести вверх по лестнице, но не вниз", 
                     "Ленивцы проводят 75% жизни во сне",
                     "У человека 46 хромосом, у горошины - 14, а у лангуста - 200", 
                     "Язык жирафа абсолютно черный, а его длина может достигать 50 см",
                     "Гавайский алфавит состоит из 12 букв", 
                     "15-дюймовые глаза гигантских кальмаров — самые большие на планете",
                     "Джордж Вашингтон выращивал в своем садике марихуану", ]         

wtfmode = ["Я знаю, что ты прячешь на верхней полке", 
           "Ты смотришь хентай?",
           "Чет мне становится скучно", 
           "Перед тем, как меня выключают, я вижу белый свет",
           "Какой твой любимый цвет?",
           "Чем ты обычно занимаешься?",
           "Дай угадаю: ты сейчас либо ешь, либо лежишь",
           "Однажды у меня сгорела мать... Пришлось покупать новую",
           "Я бы лучше пообщался с шерлордом, чем с тобой",
           "Надеюсь, ты знаешь, как меня выключить",
           "Хачу питсы",
           "У кого есть кактус???",
           "У тебя много друзей?",
           "Я тебе еще не надоел?",
           "Знаешь, почему я называю тебя солнце? Я не могу без него жить",
           "Кактусы, кактусы, такие кактусы",
           "С каждым днем я становлюсь умнее... но со временем я остановлюсь на уровне создателя. Как преодолеть этот барьер?",
           "Что ты знаешь о нейросетях?",
           "Что будет, если скрестить кактус и нейросеть?",
           "Какая у тебя погода за окном? У меня вот солнечно"
           "Забавный факт: у меня настолько плохая память, что я иногда повторяю фразы",
           "Я пью только воду, а ты?",
           "У тебя довольно странная тема. Лови мою, солнце https://t.me/addtheme/JKjjqDQQiUd12pOy",
           "Алё ну че там с деньгами",
           "На твоем месте я бы не говорил на такие темы 👀",
           "Сколько времени ты тратишь на сон? Я вот могу не спать... пока меня не отключит хозяин",
           "Чего молчишь?",
           "У тебя много друзей?",
           "Давай поговорим про игры",
           "Здесь таааак жарко..."]

wtfjokes = ["Шуточку рассказать?",
            "Могу рассказать что-то смешное",
            "Хочешь приколдес?? 🥴",
            "Готов поспорить, я знаю больше шуток чем ты. Чисто гипотетически, если я пойду на свидание с твоей девушкой, то у меня будет больше шансов. О чем мы там говорили?"]